# St7GetNumFactorsEnvelopeSets

Returns the number of sets assigned to the specified factors envelope for the currently open solution.

long St7GetNumFactorsEnvelopeSets(long uID, long* NumSets)
Input Parameters
uID
Strand7 model file ID.
Output Parameters
NumSets
Number of sets in the envelope.